emacs/.emacs.d/config.org
#+TITLE: Emacs Configurations
* Emacs gc buffer increase
#+BEGIN_SRC emacs lisp
(run-with-idle-timer
 5 nil
 (lambda ()
   (setq gc-cons-threshold 1000000)
   (message "gc-cons-threshold restored to %S"
            gc-cons-threshold)))
#+END_SRC
  
* Repositories
  #+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives '("melpa" . "http://melpa.milkbox.net/packages/") t)
(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
  #+END_SRC

* C++ indentation style
  Set Default indentation
  #+BEGIN_SRC emacs-lisp
(setq c-default-style "bsd"
      c-basic-offset 4)
  #+END_SRC
* CMake-IDE
  # #+BEGIN_SRC emacs-lisp
  # (require 'rtags)
  # (cmake-ide-setup)
  # #+END_SRC
* Company-mode
  #+BEGIN_SRC emacs-lisp
(require 'company)
(require 'company-anaconda)
(require 'company-auctex)
(require 'company-bibtex)
(require 'company-math)
(add-hook 'after-init-hook 'global-company-mode)
(eval-after-load "company"
  '(add-to-list 'company-backends 'company-anaconda))
(add-hook 'python-mode-hook 'anaconda-mode)
(require 'company-auctex)
(company-auctex-init)
(setq company-dabbrev-downcase 0)
(setq company-idle-delay 0)
  #+END_SRC
* Default Browser
  #+BEGIN_SRC emacs-lisp
;; set specific browser to open links
(setq browse-url-browser-function 'browse-url-firefox)   
  #+END_SRC

* Defaults - custom faces/variables
  Use some default/automated settings from [[file:~/.emacs][.emacs]]
  #+BEGIN_SRC emacs-lisp
(package-initialize)
;; Added by Package.el.  This must come before configurations of
;; installed packages.  Don't delete this line.  If you don't want it,
;; just comment it out by adding a semicolon to the start of the line.
;; You may delete these explanatory comments.
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(column-number-mode t)
 '(cua-enable-cua-keys t)
 '(cua-mode t nil (cua-base))
 '(custom-enabled-themes (quote (misterioso)))
 '(delete-selection-mode t)
 '(global-linum-mode t)
 '(inhibit-startup-screen t)
 '(package-selected-packages
   (quote
    (sphinx-doc yasnippet-snippets company-shell pdf-tools company-jedi pretty-symbols sublimity latex-preview-pane paredit company company-anaconda company-auctex company-bibtex company-c-headers company-irony company-math neotree irony auctex-lua auctex-latexmk)))
 '(show-paren-mode t)
 '(global-visual-line-mode t)
 '(show-paren-style (quote mixed))
 '(tool-bar-style (quote image)))

;; Added by Package.el.  This must come before configurations of
;; installed packages.  Don't delete this line.  If you don't want it,
;; just comment it out by adding a semicolon to the start of the line.
;; You may delete these explanatory comments.
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(default ((t (:inherit nil :stipple nil :inverse-video nil :box nil :strike-through nil :overline nil :underline nil :slant normal :weight normal :height 113 :width normal :foundry "unknown")))))
(require 'iso-transl)
(global-hl-line-mode t)
  #+END_SRC

* Don't ask so many questions about compiling
 #+BEGIN_SRC emacs-lisp
;; Shut up compile saves
(setq compilation-ask-about-save nil)
;; Don't save *anything*
(setq compilation-save-buffers-predicate '(lambda () nil))

(require 'iso-transl)
(defalias 'yes-or-no-p 'y-or-n-p)
  #+END_SRC
* Expand region
  #+BEGIN_SRC emacs-lisp
  (require 'expand-region)
  (global-set-key (kbd "C-=") 'er/expand-region)
  #+END_SRC
* Fill column indicator
  #+BEGIN_SRC emacs-lisp
(require 'fill-column-indicator)
(define-globalized-minor-mode global-fci-mode fci-mode (
  lambda () (fci-mode 1)))

;; (add-hook 'prog-mode-hook (lambda () (fci-mode 1)))
;; (global-fci-mode 1)

(setq fci-rule-column 80)
#+END_SRC

* Flyspell Spellchecking
  #+BEGIN_SRC emacs-lisp
(require 'flyspell)
(add-hook 'LaTeX-mode-hook
	  '(lambda () (flyspell-mode t))
          '(lambda () (flyspell-popup-auto-correct-mode)))
(add-hook 'org-mode-hook
	  '(lambda () (flyspell-mode t))
          '(lambda () (flyspell-popup-auto-correct-mode)))
(eval-after-load "flyspell"
  '(progn (define-key flyspell-mode-map (kbd "C-;") nil)))
  #+END_SRC

* Guess-language
#+BEGIN_SRC emacs-lisp
(require 'guess-language)
;; Optionally:
(setq guess-language-languages '(en dk))
(setq guess-language-min-paragraph-length 35)
#+END_SRC
  
* Highlight-symbols
  #+BEGIN_SRC emacs-lisp
;; Highlight same symbols
(require 'highlight-symbol)
(setq highlight-symbol-mode t)

(define-globalized-minor-mode global-highlight-symbol-mode 
  highlight-symbol-mode (
  lambda () (highlight-symbol-mode 1)))
(global-highlight-symbol-mode 1)
  #+END_SRC
* Hungry Delete
  #+BEGIN_SRC emacs-lisp
  ; deletes all the whitespace when you hit backspace or delete
  (require 'hungry-delete)
  (global-hungry-delete-mode)
  #+END_SRC
* Hotkeys
  #+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-;") 'iedit-mode)
(global-set-key (kbd "C-c b b") 'bjm-comment-box)
(global-set-key (kbd "C-c n") #'lunaryorn-new-buffer-frame)
(global-set-key (kbd "M-9") 'kill-whole-line)
(global-set-key (kbd "M-<down>") 'move-line-down)
(global-set-key (kbd "M-<up>") 'move-line-up)
(global-set-key [C-tab] 'other-window)
(global-set-key [f6] 'doxymacs-mode)
(global-set-key [f7] 'highlight-symbol-mode)
(global-set-key [f8] 'neotree-toggle)
(global-set-key [f9] 'ispell-change-dictionary)
#+END_SRC

* Ido-mode
  #+BEGIN_SRC emacs-lisp
(setq ido-enable-flex-matching t)(setq ido-everywhere t)
(ido-mode 1)
  #+END_SRC

* Iedit
#+BEGIN_SRC emacs-lisp
(require 'iedit)

(defun iedit-dwim (arg)
  "Starts iedit but uses \\[narrow-to-defun] to limit its scope."
  (interactive "P")
  (if arg
      (iedit-mode)
    (save-excursion
      (save-restriction
        (widen)
        ;; this function determines the scope of `iedit-start'.
        (if iedit-mode
            (iedit-done)
          ;; `current-word' can of course be replaced by other
          ;; functions.
          (narrow-to-defun)
          (iedit-start (current-word) (point-min) (point-max)))))))
#+END_SRC

* LaTeX
** Sane settings
  #+BEGIN_SRC emacs-lisp
(setq TeX-source-correlate-start-server t)
(setq TeX-PDF-mode t)
(setq TeX-source-correlate-mode t)
(setq TeX-source-correlate-method 'synctex)
(save-place-mode 1)
(set-default 'truncate-lines t)
(setq-default TeX-parse-self t) ;; Enable parsing of the file itself on load
(setq-default TeX-auto-save t) ;; Enable save on command executation (e.g., LaTeX)
(setq-default TeX-save-query nil) ;; Don't even ask about it
(setq TeX-electric-sub-and-superscript t)
(add-hook 'LaTeX-mode-hook
	  (lambda ()
	     (define-key LaTeX-mode-map (kbd "$") 'self-insert-command)))
(setq TeX-insert-braces t)

  #+END_SRC
** Align to space or "&"
   #+BEGIN_SRC emacs-lisp
   (defun align-whitespace (start end)
   "Align columns by whitespace"
   (interactive "r")
   (align-regexp start end
                "\\(\\s-*\\)\\s-" 1 0 t))
		
   (defun align-& (start end)
   "Align columns by ampersand"
   (interactive "r")
   (align-regexp start end
                "\\(\\s-*\\)&" 1 1 t))
   #+END_SRC

** Close mathmode as well
   #+BEGIN_SRC emacs-lisp
(electric-pair-mode)
(add-hook 'LaTeX-mode-hook
          '(lambda () (define-key LaTeX-mode-map (kbd "$") 'self-insert-command)))
   #+END_SRC

** RefTeX - local tree structure
   #+BEGIN_SRC emacs-lisp
;; RefTex - Locale tree-structure
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)
(setq reftex-plug-into-AUCTeX t)
   #+END_SRC

* Neotree
  #+BEGIN_SRC emacs-lisp
(require 'neotree)
(require 'all-the-icons)

 ;; every time when the neotree window is  opened, it will try to find current
 ;; file and jump to node.
 (setq-default neo-smart-open t)

 ;; change root automatically when running `projectile-switch-project`
 (setq projectile-switch-project-action 'neotree-projectile-action)


 (setq neo-theme (if window-system 'icons 'nerd)) ; 'classic, 'nerd, 'ascii, 'arrow

 (setq neo-vc-integration '(face char))

 (setq neo-show-hidden-files t)

 (setq neo-toggle-window-keep-p t)

 (setq neo-force-change-root t)

 (add-hook 'neotree-mode-hook
           (lambda ()
             (setq-local mode-line-format nil)
             (setq-local display-line-numbers nil)
             (local-set-key (kbd "C-s") 'isearch-forward)
             (local-set-key (kbd "C-M-s") 'isearch-forward-regexp)
             (local-set-key (kbd "C-r") 'isearch-backward)
             (local-set-key (kbd "C-M-r") 'isearch-backward-regexp)))

 (add-to-list 'all-the-icons-icon-alist
              '("^build\.boot$" all-the-icons-alltheicon "clojure-line" :height 1.0 :face all-the-icons-blue :v-adjust 0.0))

 ;; face customizations

 (set-face-attribute 'neo-vc-edited-face nil
                     :foreground "#E2C08D")

 (set-face-attribute 'neo-vc-added-face nil
                     :foreground "green4")

 (eval-after-load "neotree"
    '(add-to-list 'window-size-change-functions
                  (lambda (frame)
                    (let ((neo-window (neo-global--get-window)))
                      (unless (null neo-window)
                        (setq neo-window-width (window-width neo-window)))))))
 (provide 'setup-neotree)
  #+END_SRC
  
* Org-mode
  All the settings for OrgMode to be fancy and nifty.
** Allowing execution of code blocks
   # #+BEGIN_SRC emacs-lisp
   (org-babel-do-load-languages
 'org-babel-load-languages
 (mapcar (lambda (lang) (cons lang t))
         `(python
           python3
           ,(if (locate-library "ob-shell") 'shell 'sh)
           sqlite
           )))

   # #+END_SRC
** Org-bullets
   Pretty bullet points
   #+BEGIN_SRC emacs-lisp
   (require 'org-bullets)
   (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
   #+END_SRC
   
** Fancy todo-tiles
   Make a fancy symbol for the todo tiles.
   #+BEGIN_SRC emacs-lisp
(setq org-todo-keywords '((sequence "☛ TODO(t)" "|" "⚑ DOING(w)" "|" "✔ DONE(d)" "|" "✘ CANCELED(c)")))
   #+END_SRC
   
** Export to Twitter Bootstrap
   Twitter bootstrap is a really neat looking layout for the exportet HTML files.
   #+BEGIN_SRC emacs-lisp
(require 'ox-twbs)
   #+END_SRC

** Pretty fontification
   #+BEGIN_SRC emacs-lisp
(setq org-src-fontify-natively t)
   #+END_SRC

** Table of contents
#+BEGIN_SRC emacs-lisp
(if (require 'toc-org nil t)
     (add-hook 'org-mode-hook 'toc-org-mode)
  (warn "toc-org not found"))'
#+END_SRC
* Python
** Jedi-mode
   #+BEGIN_SRC emacs-lisp
(add-hook 'python-mode-hook 'jedi:setup)
(setq jedi:complete-on-dot t)                 ; optional
   #+END_SRC

** Python docstrings
   #+BEGIN_SRC emacs-lisp
;;Python docstrings
(add-hook 'python-mode-hook
	  (lambda ()(require 'sphinx-doc)(sphinx-doc-mode t)))
   #+END_SRC
** Pyvenv
   #+BEGIN_SRC emacs-lisp
    (setenv "WORKON_HOME" "/home/fuzie/anaconda3/envs")
    (pyvenv-mode 1)
    (setq python-shell-interpreter "python3")
   #+END_SRC
* Self-defined function
** Move-line up and down
   #+BEGIN_SRC emacs-lisp
;; Move line up and down
(defun move-line (n)
  "Move the current line up or down by N lines."
  (interactive "p")
  (setq col (current-column))
  (beginning-of-line) (setq start (point))
  (end-of-line) (forward-char) (setq end (point))
  (let ((line-text (delete-and-extract-region start end)))
    (forward-line n)
    (insert line-text)
    ;; restore point to original column in moved line
    (forward-line -1)
    (forward-char col)))

(defun move-line-up (n)
  "Move the current line up by N lines."
  (interactive "p")
  (move-line (if (null n) -1 (- n))))

(defun move-line-down (n)
  "Move the current line down by N lines."
  (interactive "p")
  (move-line (if (null n) 1 n)))
   #+END_SRC
** Move region up and down
   #+BEGIN_SRC emacs-lisp
(defun move-region (start end n)
  "Move the current region up or down by N lines."
  (interactive "r\np")
  (let ((line-text (delete-and-extract-region start end)))
    (forward-line n)
    (let ((start (point)))
      (insert line-text)
      (setq deactivate-mark nil)
      (set-mark start))))

(defun move-region-up (start end n)
  "Move the current line up by N lines."
  (interactive "r\np")
  (move-region start end (if (null n) -1 (- n))))

(defun move-region-down (start end n)
  "Move the current line down by N lines."
  (interactive "r\np")
  (move-region start end (if (null n) 1 n)))

(global-set-key (kbd "M-<up>") 'move-region-up)
(global-set-key (kbd "M-<down>") 'move-region-down)
   #+END_SRC
** Comment box
   #+BEGIN_SRC emacs-lisp
   ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
   ;; Full width comment box                                                 ;;
   ;; from http://irreal.org/blog/?p=374                                     ;;
   ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
   (defun bjm-comment-box (b e)
   "Draw a box comment around the region but arrange for the region to extend 
   to at least the fill column. Place the point after the comment box."

   (interactive "r")

   (let ((e (copy-marker e t)))
     (goto-char b)
     (end-of-line)
     (insert-char ?  (- fill-column (current-column)))
     (comment-box b e 1)
     (goto-char e)
     (set-marker e nil)))
   #+END_SRC
* Smooth scroll
  #+BEGIN_SRC emacs-lisp
;; Smooth scrolling and map
(require 'sublimity)
;;(require 'sublimity-scroll)
(require 'sublimity-attractive)
;;(sublimity-mode 1)
(setq sublimity-scroll-weight 10
      sublimity-scroll-drift-length 0)
  #+END_SRC
* Yasnippet
a package making tab completion stupidly easy to set up and use for all modes.

  #+BEGIN_SRC emacs-lisp
(require 'yasnippet)           
(yas-global-mode 1)
  #+END_SRC

* Default init-file
  #+BEGIN_SRC emacs-lisp
(find-file "/home/fuzie/Dropbox/TODO/todo.org")
  
  #+END_SRC
